results/factorial-final/security-overhead-final-plaintext-broker5/security-overhead-final-factorial-plaintext-b5-rf5-isr4-msg102400-tps1000-batch16384-acksall-prod12-complz4-trial2/producer-perf-10.log
producer_index=10
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 9865.0 ms avg latency, 9865.0 ms max latency.
199 records sent, 39.8 records/sec (3.89 MB/sec), 780.0 ms avg latency, 2531.0 ms max latency.
210 records sent, 41.7 records/sec (4.08 MB/sec), 189.1 ms avg latency, 499.0 ms max latency.
213 records sent, 42.2 records/sec (4.12 MB/sec), 124.6 ms avg latency, 359.0 ms max latency.
219 records sent, 43.7 records/sec (4.27 MB/sec), 119.4 ms avg latency, 325.0 ms max latency.
260 records sent, 51.0 records/sec (4.98 MB/sec), 108.1 ms avg latency, 406.0 ms max latency.
305 records sent, 60.8 records/sec (5.94 MB/sec), 65.3 ms avg latency, 269.0 ms max latency.
343 records sent, 68.2 records/sec (6.66 MB/sec), 51.0 ms avg latency, 263.0 ms max latency.
329 records sent, 65.2 records/sec (6.37 MB/sec), 47.5 ms avg latency, 164.0 ms max latency.
367 records sent, 72.2 records/sec (7.05 MB/sec), 46.0 ms avg latency, 229.0 ms max latency.
341 records sent, 67.1 records/sec (6.55 MB/sec), 49.0 ms avg latency, 171.0 ms max latency.
287 records sent, 56.8 records/sec (5.55 MB/sec), 55.7 ms avg latency, 174.0 ms max latency.
305 records sent, 60.5 records/sec (5.90 MB/sec), 75.9 ms avg latency, 295.0 ms max latency.
267 records sent, 52.9 records/sec (5.17 MB/sec), 45.4 ms avg latency, 150.0 ms max latency.
274 records sent, 54.6 records/sec (5.34 MB/sec), 52.4 ms avg latency, 221.0 ms max latency.
311 records sent, 61.9 records/sec (6.05 MB/sec), 61.5 ms avg latency, 405.0 ms max latency.
256 records sent, 50.7 records/sec (4.95 MB/sec), 44.1 ms avg latency, 204.0 ms max latency.
283 records sent, 56.4 records/sec (5.51 MB/sec), 44.6 ms avg latency, 172.0 ms max latency.
280 records sent, 55.9 records/sec (5.45 MB/sec), 47.0 ms avg latency, 243.0 ms max latency.
263 records sent, 52.4 records/sec (5.12 MB/sec), 62.1 ms avg latency, 350.0 ms max latency.
319 records sent, 63.7 records/sec (6.22 MB/sec), 92.4 ms avg latency, 464.0 ms max latency.
299 records sent, 59.8 records/sec (5.84 MB/sec), 49.3 ms avg latency, 300.0 ms max latency.
301 records sent, 60.1 records/sec (5.87 MB/sec), 43.0 ms avg latency, 181.0 ms max latency.
299 records sent, 59.5 records/sec (5.81 MB/sec), 47.9 ms avg latency, 214.0 ms max latency.
304 records sent, 60.6 records/sec (5.92 MB/sec), 69.9 ms avg latency, 345.0 ms max latency.
282 records sent, 56.2 records/sec (5.48 MB/sec), 41.4 ms avg latency, 149.0 ms max latency.
285 records sent, 57.0 records/sec (5.57 MB/sec), 39.2 ms avg latency, 177.0 ms max latency.
324 records sent, 64.5 records/sec (6.30 MB/sec), 40.4 ms avg latency, 188.0 ms max latency.
272 records sent, 53.8 records/sec (5.26 MB/sec), 39.0 ms avg latency, 166.0 ms max latency.
303 records sent, 60.0 records/sec (5.86 MB/sec), 56.1 ms avg latency, 229.0 ms max latency.
8333 records sent, 53.031171 records/sec (5.18 MB/sec), 80.29 ms avg latency, 9865.00 ms max latency, 45 ms 50th, 213 ms 95th, 789 ms 99th, 2039 ms 99.9th.